// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
Console.WriteLine("enter number");
int number = Convert.ToInt32(Console.ReadLine());
int a = 0;

a= number*number*number;

Console.WriteLine(a);
